## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # zentral_munki_script_check.mcs-auditing-audit_control_acls_configure will be created
  + resource "zentral_munki_script_check" "mcs-auditing-audit_control_acls_configure" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = "/etc/security/audit_control _MUST_ not contain Access Control Lists (ACLs)."
      + excluded_tag_ids = (known after apply)
      + expected_result  = "0"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Auditing - Configure Audit_Control to Not Contain Access Control Lists"
      + source           = "/bin/ls -le /etc/security/audit_control | /usr/bin/awk '{print $1}' | /usr/bin/grep -c \":\""
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-auditing-audit_control_group_configure will be created
  + resource "zentral_munki_script_check" "mcs-auditing-audit_control_group_configure" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = "/etc/security/audit_control _MUST_ have the group set to wheel."
      + excluded_tag_ids = (known after apply)
      + expected_result  = "0"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Auditing - Configure Audit_Control Group to Wheel"
      + source           = "/bin/ls -dn /etc/security/audit_control | /usr/bin/awk '{print $4}'"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-auditing-audit_control_mode_configure will be created
  + resource "zentral_munki_script_check" "mcs-auditing-audit_control_mode_configure" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = "/etc/security/audit_control _MUST_ be configured so that it is readable only by the root user and group wheel."
      + excluded_tag_ids = (known after apply)
      + expected_result  = "0"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Auditing - Configure Audit_Control Owner to Mode 440 or Less Permissive"
      + source           = "/bin/ls -l /etc/security/audit_control | /usr/bin/awk '!/-r--[r-]-----|current|total/{print $1}' | /usr/bin/wc -l | /usr/bin/xargs"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-auditing-audit_control_owner_configure will be created
  + resource "zentral_munki_script_check" "mcs-auditing-audit_control_owner_configure" {
      + arch_amd64       = true
      + arch_arm64       = true
      + description      = "/etc/security/audit_control _MUST_ have the owner set to root."
      + excluded_tag_ids = (known after apply)
      + expected_result  = "0"
      + id               = (known after apply)
      + max_os_version   = "15"
      + min_os_version   = "14"
      + name             = "[mSCP] - Auditing - Configure Audit_Control Owner to Root"
      + source           = "/bin/ls -dn /etc/security/audit_control | /usr/bin/awk '{print $3}'"
      + tag_ids          = (known after apply)
      + type             = "ZSH_INT"
      + version          = (known after apply)
    }

  # zentral_munki_script_check.mcs-auditing-audit_failure_halt will be destroyed
  # (because zentral_munki_script_check.mcs-auditing-audit_failure_halt is not in configuration)
  - resource "zentral_munki_script_check" "mcs-auditing-audit_failure_halt" {
      - arch_amd64       = true -> null
      - arch_arm64       = true -> null
      - description      = <<-EOT
            The audit service _MUST_ be configured to shut down the computer if it is unable to audit system events.
            
            Once audit failure occurs, user and system activity are no longer recorded, and malicious activity could go undetected. Audit processing failures can occur due to software/hardware errors, failures in the audit capturing mechanisms, and audit storage capacity being reached or exceeded.
        EOT -> null
      - excluded_tag_ids = [] -> null
      - expected_result  = "1" -> null
      - id               = 62 -> null
      - max_os_version   = "15" -> null
      - min_os_version   = "14" -> null
      - name             = "[mSCP] - Auditing - Configure System to Shut Down Upon Audit Failure" -> null
      - source           = "/usr/bin/awk -F':' '/^policy/ {print $NF}' /etc/security/audit_control | /usr/bin/tr ',' '\\n' | /usr/bin/grep -Ec 'ahlt'" -> null
      - tag_ids          = [] -> null
      - type             = "ZSH_INT" -> null
      - version          = 1 -> null
    }

  # zentral_munki_script_check.mcs-auditing-audit_flags_aa_configure will be destroyed
  # (because zentral_munki_script_check.mcs-auditing-audit_flags_aa_configure is not in configuration)
  - resource "zentral_munki_script_check" "mcs-auditing-audit_flags_aa_configure" {
      - arch_amd64       = true -> null
      - arch_arm64       = true -> null
      - description      = <<-EOT
            The auditing system _MUST_ be configured to flag authorization and authentication (aa) events.
            
            Authentication events contain information about the identity of a user, server, or client. Authorization events contain information about permissions, rights, and rules. If audit records do not include aa events, it is difficult to identify incidents and to correlate incidents to subsequent events.
            
            Audit records can be generated from various components within the information system (e.g., via a module or policy filter).
        EOT -> null
      - excluded_tag_ids = [] -> null
      - expected_result  = "1" -> null
      - id               = 41 -> null
      - max_os_version   = "15" -> null
      - min_os_version   = "14" -> null
      - name             = "[mSCP] - Auditing - Configure System to Audit All Authorization and Authentication Events" -> null
      - source           = "/usr/bin/awk -F':' '/^flags/ { print $NF }' /etc/security/audit_control | /usr/bin/tr ',' '\\n' | /usr/bin/grep -Ec 'aa'" -> null
      - tag_ids          = [] -> null
      - type             = "ZSH_INT" -> null
      - version          = 1 -> null
    }

  # zentral_munki_script_check.mcs-auditing-audit_flags_ad_configure will be destroyed
  # (because zentral_munki_script_check.mcs-auditing-audit_flags_ad_configure is not in configuration)
  - resource "zentral_munki_script_check" "mcs-auditing-audit_flags_ad_configure" {
      - arch_amd64       = true -> null
      - arch_arm64       = true -> null
      - description      = <<-EOT
            The auditing system _MUST_ be configured to flag administrative action (ad) events.
            
            Administrative action events include changes made to the system (e.g. modifying authentication policies). If audit records do not include ad events, it is difficult to identify incidents and to correlate incidents to subsequent events.
            
            Audit records can be generated from various components within the information system (e.g., via a module or policy filter).
            
            The information system audits the execution of privileged functions.
            
            NOTE: We recommend changing the line "43127:AUE_MAC_SYSCALL:mac_syscall(2):ad" to "43127:AUE_MAC_SYSCALL:mac_syscall(2):zz" in the file /etc/security/audit_event. This will prevent sandbox violations from being audited by the ad flag.
        EOT -> null
      - excluded_tag_ids = [] -> null
      - expected_result  = "1" -> null
      - id               = 117 -> null
      - max_os_version   = "15" -> null
      - min_os_version   = "14" -> null
      - name             = "[mSCP] - Auditing - Configure System to Audit All Administrative Action Events" -> null
      - source           = "/usr/bin/awk -F':' '/^flags/ { print $NF }' /etc/security/audit_control | /usr/bin/tr ',' '\\n' | /usr/bin/grep -Ec 'ad'" -> null
      - tag_ids          = [] -> null
      - type             = "ZSH_INT" -> null
      - version          = 1 -> null
    }

  # zentral_munki_script_check.mcs-auditing-audit_flags_ex_configure will be destroyed
  # (because zentral_munki_script_check.mcs-auditing-audit_flags_ex_configure is not in configuration)
  - resource "zentral_munki_script_check" "mcs-auditing-audit_flags_ex_configure" {
      - arch_amd64       = true -> null
      - arch_arm64       = true -> null
      - description      = <<-EOT
            The audit system _MUST_ be configured to record enforcement actions of access restrictions, including failed program execute (-ex) attempts.
            
            Enforcement actions are the methods or mechanisms used to prevent unauthorized access and/or changes to configuration settings. One common and effective enforcement action method is using program execution restrictions (e.g., denying users access to execute certain processes).
            
            This configuration ensures that audit lists include events in which program execution has failed.
            Without auditing the enforcement of program execution, it is difficult to identify attempted attacks, as there is no audit trail available for forensic investigation.
        EOT -> null
      - excluded_tag_ids = [] -> null
      - expected_result  = "1" -> null
      - id               = 23 -> null
      - max_os_version   = "15" -> null
      - min_os_version   = "14" -> null
      - name             = "[mSCP] - Auditing - Configure System to Audit All Failed Program Execution on the System" -> null
      - source           = "/usr/bin/awk -F':' '/^flags/ { print $NF }' /etc/security/audit_control | /usr/bin/tr ',' '\\n' | /usr/bin/grep -Ec '\\-ex'" -> null
      - tag_ids          = [] -> null
      - type             = "ZSH_INT" -> null
      - version          = 1 -> null
    }

  # zentral_munki_script_check.mcs-auditing-audit_flags_fd_configure will be destroyed
  # (because zentral_munki_script_check.mcs-auditing-audit_flags_fd_configure is not in configuration)
  - resource "zentral_munki_script_check" "mcs-auditing-audit_flags_fd_configure" {
      - arch_amd64       = true -> null
      - arch_arm64       = true -> null
      - description      = <<-EOT
            The audit system _MUST_ be configured to record enforcement actions of attempts to delete file attributes (fd).
            
            ***Enforcement actions are the methods or mechanisms used to prevent unauthorized changes to configuration settings. One common and effective enforcement action method is using access restrictions (i.e., denying modifications to a file by applying file permissions).
            
            This configuration ensures that audit lists include events in which enforcement actions prevent attempts to delete a file.
            
            Without auditing the enforcement of access restrictions, it is difficult to identify attempted attacks, as there is no audit trail available for forensic investigation.
        EOT -> null
      - excluded_tag_ids = [] -> null
      - expected_result  = "1" -> null
      - id               = 15 -> null
      - max_os_version   = "15" -> null
      - min_os_version   = "14" -> null
      - name             = "[mSCP] - Auditing - Configure System to Audit All Deletions of Object Attributes" -> null
      - source           = "/usr/bin/awk -F':' '/^flags/ { print $NF }' /etc/security/audit_control | /usr/bin/tr ',' '\\n' | /usr/bin/grep -Ec '\\-fd'" -> null
      - tag_ids          = [] -> null
      - type             = "ZSH_INT" -> null
      - version          = 1 -> null
    }

  # zentral_munki_script_check.mcs-auditing-audit_flags_fm_failed_configure will be destroyed
  # (because zentral_munki_script_check.mcs-auditing-audit_flags_fm_failed_configure is not in configuration)
  - resource "zentral_munki_script_check" "mcs-auditing-audit_flags_fm_failed_configure" {
      - arch_amd64       = true -> null
      - arch_arm64       = true -> null
      - description      = <<-EOT
            The audit system _MUST_ be configured to record enforcement actions of failed attempts to modify file attributes (-fm).
            
            Enforcement actions are the methods or mechanisms used to prevent unauthorized changes to configuration settings. One common and effective enforcement action method is using access restrictions (i.e., denying modifications to a file by applying file permissions).
            
            This configuration ensures that audit lists include events in which enforcement actions prevent attempts to modify a file.
            
            Without auditing the enforcement of access restrictions, it is difficult to identify attempted attacks, as there is no audit trail available for forensic investigation.
        EOT -> null
      - excluded_tag_ids = [] -> null
      - expected_result  = "1" -> null
      - id               = 96 -> null
      - max_os_version   = "15" -> null
      - min_os_version   = "14" -> null
      - name             = "[mSCP] - Auditing - Configure System to Audit All Failed Change of Object Attributes" -> null
      - source           = "/usr/bin/awk -F':' '/^flags/ { print $NF }' /etc/security/audit_control | /usr/bin/tr ',' '\\n' | /usr/bin/grep -Ec '\\-fm'" -> null
      - tag_ids          = [] -> null
      - type             = "ZSH_INT" -> null
      - version          = 1 -> null
    }

  # zentral_munki_script_check.mcs-auditing-audit_flags_fr_configure will be destroyed
  # (because zentral_munki_script_check.mcs-auditing-audit_flags_fr_configure is not in configuration)
  - resource "zentral_munki_script_check" "mcs-auditing-audit_flags_fr_configure" {
      - arch_amd64       = true -> null
      - arch_arm64       = true -> null
      - description      = <<-EOT
            The audit system _MUST_ be configured to record enforcement actions of access restrictions, including failed file read (-fr) attempts.
            
            Enforcement actions are the methods or mechanisms used to prevent unauthorized access and/or changes to configuration settings. One common and effective enforcement action method is using access restrictions (e.g., denying access to a file by applying file permissions).
            
            This configuration ensures that audit lists include events in which enforcement actions prevent attempts to read a file.
            
            Without auditing the enforcement of access restrictions, it is difficult to identify attempted attacks, as there is no audit trail available for forensic investigation.
        EOT -> null
      - excluded_tag_ids = [] -> null
      - expected_result  = "1" -> null
      - id               = 26 -> null
      - max_os_version   = "15" -> null
      - min_os_version   = "14" -> null
      - name             = "[mSCP] - Auditing - Configure System to Audit All Failed Read Actions on the System" -> null
      - source           = "/usr/bin/awk -F':' '/^flags/ { print $NF }' /etc/security/audit_control | /usr/bin/tr ',' '\\n' | /usr/bin/grep -Ec '\\-fr'" -> null
      - tag_ids          = [] -> null
      - type             = "ZSH_INT" -> null
      - version          = 1 -> null
    }

  # zentral_munki_script_check.mcs-auditing-audit_flags_fw_configure will be destroyed
  # (because zentral_munki_script_check.mcs-auditing-audit_flags_fw_configure is not in configuration)
  - resource "zentral_munki_script_check" "mcs-auditing-audit_flags_fw_configure" {
      - arch_amd64       = true -> null
      - arch_arm64       = true -> null
      - description      = <<-EOT
            The audit system _MUST_ be configured to record enforcement actions of access restrictions, including failed file write (-fw) attempts.
            
            Enforcement actions are the methods or mechanisms used to prevent unauthorized access and/or changes to configuration settings. One common and effective enforcement action method is using access restrictions (e.g., denying users access to edit a file by applying file permissions).
            
            This configuration ensures that audit lists include events in which enforcement actions prevent attempts to change a file.
            
            Without auditing the enforcement of access restrictions, it is difficult to identify attempted attacks, as there is no audit trail available for forensic investigation.
        EOT -> null
      - excluded_tag_ids = [] -> null
      - expected_result  = "1" -> null
      - id               = 100 -> null
      - max_os_version   = "15" -> null
      - min_os_version   = "14" -> null
      - name             = "[mSCP] - Auditing - Configure System to Audit All Failed Write Actions on the System" -> null
      - source           = "/usr/bin/awk -F':' '/^flags/ { print $NF }' /etc/security/audit_control | /usr/bin/tr ',' '\\n' | /usr/bin/grep -Ec '\\-fw'" -> null
      - tag_ids          = [] -> null
      - type             = "ZSH_INT" -> null
      - version          = 1 -> null
    }

  # zentral_munki_script_check.mcs-auditing-audit_flags_lo_configure will be destroyed
  # (because zentral_munki_script_check.mcs-auditing-audit_flags_lo_configure is not in configuration)
  - resource "zentral_munki_script_check" "mcs-auditing-audit_flags_lo_configure" {
      - arch_amd64       = true -> null
      - arch_arm64       = true -> null
      - description      = <<-EOT
            The audit system _MUST_ be configured to record all attempts to log in and out of the system (lo).
            
            Frequently, an attacker that successfully gains access to a system has only gained access to an account with limited privileges, such as a guest account or a service account. The attacker must attempt to change to another user account with normal or elevated privileges in order to proceed. Auditing both successful and unsuccessful attempts to switch to another user account (by way of monitoring login and logout events) mitigates this risk.
            
            The information system monitors login and logout events.
        EOT -> null
      - excluded_tag_ids = [] -> null
      - expected_result  = "1" -> null
      - id               = 149 -> null
      - max_os_version   = "15" -> null
      - min_os_version   = "14" -> null
      - name             = "[mSCP] - Auditing - Configure System to Audit All Log In and Log Out Events" -> null
      - source           = "/usr/bin/awk -F':' '/^flags/ { print $NF }' /etc/security/audit_control | /usr/bin/tr ',' '\\n' | /usr/bin/grep -Ec '^lo'" -> null
      - tag_ids          = [] -> null
      - type             = "ZSH_INT" -> null
      - version          = 1 -> null
    }

  # zentral_munki_script_check.mcs-auditing-audit_settings_failure_notify will be destroyed
  # (because zentral_munki_script_check.mcs-auditing-audit_settings_failure_notify is not in configuration)
  - resource "zentral_munki_script_check" "mcs-auditing-audit_settings_failure_notify" {
      - arch_amd64       = true -> null
      - arch_arm64       = true -> null
      - description      = <<-EOT
            The audit service _MUST_ be configured to immediately print messages to the console or email administrator users when an auditing failure occurs.
            
            It is critical for the appropriate personnel to be made aware immediately if a system is at risk of failing to process audit logs as required. Without a real-time alert, security personnel may be unaware of a potentially harmful failure in the auditing system's capability, and system operation may be adversely affected.
        EOT -> null
      - excluded_tag_ids = [] -> null
      - expected_result  = "1" -> null
      - id               = 34 -> null
      - max_os_version   = "15" -> null
      - min_os_version   = "14" -> null
      - name             = "[mSCP] - Auditing - Configure Audit Failure Notification" -> null
      - source           = "/usr/bin/grep -c \"logger -s -p\" /etc/security/audit_warn" -> null
      - tag_ids          = [] -> null
      - type             = "ZSH_INT" -> null
      - version          = 1 -> null
    }

  # zentral_munki_script_check.mcs-authentication-auth_pam_login_smartcard_enforce will be destroyed
  # (because zentral_munki_script_check.mcs-authentication-auth_pam_login_smartcard_enforce is not in configuration)
  - resource "zentral_munki_script_check" "mcs-authentication-auth_pam_login_smartcard_enforce" {
      - arch_amd64       = true -> null
      - arch_arm64       = true -> null
      - description      = <<-EOT
            The system _MUST_ be configured to enforce multifactor authentication.
            
            All users _MUST_ go through multifactor authentication to prevent unauthenticated access and potential compromise to the system.
            
            IMPORTANT: Modification of Pluggable Authentication Modules (PAM) now require user authorization, or use of a Privacy Preferences Policy Control (PPPC) profile from MDM that authorizes modifying system administrator files or full disk access.
            
            NOTE: /etc/pam.d/login will be automatically modified to its original state following any update or major upgrade to the operating system.
        EOT -> null
      - excluded_tag_ids = [] -> null
      - expected_result  = "2" -> null
      - id               = 127 -> null
      - max_os_version   = "15" -> null
      - min_os_version   = "14" -> null
      - name             = "[mSCP] - Authentication - Enforce Multifactor Authentication for Login" -> null
      - source           = "/usr/bin/grep -Ec '^(auth\\s+sufficient\\s+pam_smartcard.so|auth\\s+required\\s+pam_deny.so)' /etc/pam.d/login" -> null
      - tag_ids          = [] -> null
      - type             = "ZSH_INT" -> null
      - version          = 1 -> null
    }

  # zentral_munki_script_check.mcs-authentication-auth_pam_su_smartcard_enforce will be destroyed
  # (because zentral_munki_script_check.mcs-authentication-auth_pam_su_smartcard_enforce is not in configuration)
  - resource "zentral_munki_script_check" "mcs-authentication-auth_pam_su_smartcard_enforce" {
      - arch_amd64       = true -> null
      - arch_arm64       = true -> null
      - description      = <<-EOT
            The system _MUST_ be configured such that, when the su command is used, multifactor authentication is enforced.
            
            All users _MUST_ go through multifactor authentication to prevent unauthenticated access and potential compromise to the system.
            
            IMPORTANT: Modification of Pluggable Authentication Modules (PAM) now require user authorization, or use of a Privacy Preferences Policy Control (PPPC) profile from MDM that authorizes modifying system administrator files or full disk access.
            
            NOTE: /etc/pam.d/su will be automatically modified to its original state following any update or major upgrade to the operating system.
        EOT -> null
      - excluded_tag_ids = [] -> null
      - expected_result  = "2" -> null
      - id               = 9 -> null
      - max_os_version   = "15" -> null
      - min_os_version   = "14" -> null
      - name             = "[mSCP] - Authentication - Enforce Multifactor Authentication for the su Command" -> null
      - source           = "/usr/bin/grep -Ec '^(auth\\s+sufficient\\s+pam_smartcard.so|auth\\s+required\\s+pam_rootok.so)' /etc/pam.d/su" -> null
      - tag_ids          = [] -> null
      - type             = "ZSH_INT" -> null
      - version          = 1 -> null
    }

  # zentral_munki_script_check.mcs-authentication-auth_pam_sudo_smartcard_enforce will be destroyed
  # (because zentral_munki_script_check.mcs-authentication-auth_pam_sudo_smartcard_enforce is not in configuration)
  - resource "zentral_munki_script_check" "mcs-authentication-auth_pam_sudo_smartcard_enforce" {
      - arch_amd64       = true -> null
      - arch_arm64       = true -> null
      - description      = <<-EOT
            The system _MUST_ be configured to enforce multifactor authentication when the sudo command is used to elevate privilege.
            
            All users _MUST_ go through multifactor authentication to prevent unauthenticated access and potential compromise to the system.
            
            IMPORTANT: Modification of Pluggable Authentication Modules (PAM) now require user authorization, or use of a Privacy Preferences Policy Control (PPPC) profile from MDM that authorizes modifying system administrator files or full disk access.
            
            NOTE: /etc/pam.d/sudo will be automatically modified to its original state following any update or major upgrade to the operating system.
        EOT -> null
      - excluded_tag_ids = [] -> null
      - expected_result  = "2" -> null
      - id               = 12 -> null
      - max_os_version   = "15" -> null
      - min_os_version   = "14" -> null
      - name             = "[mSCP] - Authentication - Enforce Multifactor Authentication for Privilege Escalation Through the sudo Command" -> null
      - source           = "/usr/bin/grep -Ec '^(auth\\s+sufficient\\s+pam_smartcard.so|auth\\s+required\\s+pam_deny.so)' /etc/pam.d/sudo" -> null
      - tag_ids          = [] -> null
      - type             = "ZSH_INT" -> null
      - version          = 1 -> null
    }

  # zentral_munki_script_check.mcs-authentication-auth_smartcard_allow will be destroyed
  # (because zentral_munki_script_check.mcs-authentication-auth_smartcard_allow is not in configuration)
  - resource "zentral_munki_script_check" "mcs-authentication-auth_smartcard_allow" {
      - arch_amd64       = true -> null
      - arch_arm64       = true -> null
      - description      = <<-EOT
            Smartcard authentication _MUST_ be allowed.
            
            The use of smartcard credentials facilitates standardization and reduces the risk of unauthorized access.
            
            When enabled, the smartcard can be used for login, authorization, and screen saver unlocking.
        EOT -> null
      - excluded_tag_ids = [] -> null
      - expected_result  = "true" -> null
      - id               = 77 -> null
      - max_os_version   = "15" -> null
      - min_os_version   = "14" -> null
      - name             = "[mSCP] - Authentication - Allow Smartcard Authentication" -> null
      - source           = <<-EOT
            /usr/bin/osascript -l JavaScript << EOS
            $.NSUserDefaults.alloc.initWithSuiteName('com.apple.security.smartcard')\
            .objectForKey('allowSmartCard').js
            EOS
        EOT -> null
      - tag_ids          = [] -> null
      - type             = "ZSH_STR" -> null
      - version          = 1 -> null
    }

  # zentral_munki_script_check.mcs-authentication-auth_smartcard_certificate_trust_enforce_moderate will be destroyed
  # (because zentral_munki_script_check.mcs-authentication-auth_smartcard_certificate_trust_enforce_moderate is not in configuration)
  - resource "zentral_munki_script_check" "mcs-authentication-auth_smartcard_certificate_trust_enforce_moderate" {
      - arch_amd64       = true -> null
      - arch_arm64       = true -> null
      - description      = <<-EOT
            The macOS system _MUST_ be configured to block access to users who are no longer authorized (i.e., users with revoked certificates).
            
            To prevent the use of untrusted certificates, the certificates on a smartcard card _MUST_ meet the following criteria: its issuer has a system-trusted certificate, the certificate is not expired, its "valid-after" date is in the past, and it passes Certificate Revocation List (CRL) and Online Certificate Status Protocol (OCSP) checking.
            
            By setting the smartcard certificate trust level to moderate, the system will execute a soft revocation, i.e., if the OCSP/CRL server is unreachable, authentication will still succeed.
            
            NOTE: Before applying this setting, please see the smartcard supplemental guidance.
        EOT -> null
      - excluded_tag_ids = [] -> null
      - expected_result  = "2" -> null
      - id               = 4 -> null
      - max_os_version   = "15" -> null
      - min_os_version   = "14" -> null
      - name             = "[mSCP] - Authentication - Set Smartcard Certificate Trust to Moderate" -> null
      - source           = <<-EOT
            /usr/bin/osascript -l JavaScript << EOS
            $.NSUserDefaults.alloc.initWithSuiteName('com.apple.security.smartcard')\
            .objectForKey('checkCertificateTrust').js
            EOS
        EOT -> null
      - tag_ids          = [] -> null
      - type             = "ZSH_INT" -> null
      - version          = 1 -> null
    }

  # zentral_munki_script_check.mcs-authentication-auth_smartcard_enforce will be destroyed
  # (because zentral_munki_script_check.mcs-authentication-auth_smartcard_enforce is not in configuration)
  - resource "zentral_munki_script_check" "mcs-authentication-auth_smartcard_enforce" {
      - arch_amd64       = true -> null
      - arch_arm64       = true -> null
      - description      = <<-EOT
            Smartcard authentication _MUST_ be enforced.
            
            The use of smartcard credentials facilitates standardization and reduces the risk of unauthorized access.
            
            When enforceSmartCard is set to "true", the smartcard must be used for login, authorization, and unlocking the screensaver.
            
            CAUTION: enforceSmartCard will apply to the whole system. No users will be able to login with their password unless the profile is removed or a user is exempt from smartcard enforcement.
            
            NOTE: enforceSmartcard requires allowSmartcard to be set to true in order to work.
        EOT -> null
      - excluded_tag_ids = [] -> null
      - expected_result  = "true" -> null
      - id               = 156 -> null
      - max_os_version   = "15" -> null
      - min_os_version   = "14" -> null
      - name             = "[mSCP] - Authentication - Enforce Smartcard Authentication" -> null
      - source           = <<-EOT
            /usr/bin/osascript -l JavaScript << EOS
            $.NSUserDefaults.alloc.initWithSuiteName('com.apple.security.smartcard')\
            .objectForKey('enforceSmartCard').js
            EOS
        EOT -> null
      - tag_ids          = [] -> null
      - type             = "ZSH_STR" -> null
      - version          = 1 -> null
    }

  # zentral_munki_script_check.mcs-authentication-auth_ssh_password_authentication_disable will be destroyed
  # (because zentral_munki_script_check.mcs-authentication-auth_ssh_password_authentication_disable is not in configuration)
  - resource "zentral_munki_script_check" "mcs-authentication-auth_ssh_password_authentication_disable" {
      - arch_amd64       = true -> null
      - arch_arm64       = true -> null
      - description      = <<-EOT
            If remote login through SSH is enabled, password based authentication _MUST_ be disabled for user login.
            
            All users _MUST_ go through multifactor authentication to prevent unauthenticated access and potential compromise to the system.
            
            NOTE: /etc/ssh/sshd_config will be automatically modified to its original state following any update or major upgrade to the operating system.
        EOT -> null
      - excluded_tag_ids = [] -> null
      - expected_result  = "2" -> null
      - id               = 6 -> null
      - max_os_version   = "15" -> null
      - min_os_version   = "14" -> null
      - name             = "[mSCP] - Authentication - Disable Password Authentication for SSH" -> null
      - source           = "/usr/sbin/sshd -G | /usr/bin/grep -Ec '^(passwordauthentication\\s+no|kbdinteractiveauthentication\\s+no)'" -> null
      - tag_ids          = [] -> null
      - type             = "ZSH_INT" -> null
      - version          = 1 -> null
    }

  # zentral_munki_script_check.mcs-icloud-icloud_addressbook_disable will be destroyed
  # (because zentral_munki_script_check.mcs-icloud-icloud_addressbook_disab
--- TRUNCATED ---
```
</details>